{
  "id": "beef-stew",
  "title": "Beef Stew",
  "tagline": "Rich French-style stew. Fork-tender meat, hearty vegetables.",
  "description": "Rich French-style beef stew. Fork-tender meat, vegetables. Serves 6.",
  "category": "Soups & Stews",
  "categorySlug": "soups-stews",
  "prep": "30 min",
  "cook": "2½ hrs",
  "serves": "6",
  "ingredients": [
    "3 lbs beef chuck roast, cut into 1½\" cubes",
    "¼ cup flour, for dredging",
    "3 tbsp olive oil",
    "1 large onion, chopped",
    "4 garlic cloves, minced",
    "2 tbsp tomato paste",
    "1 cup dry red wine",
    "3 cups beef broth",
    "1 tbsp balsamic vinegar",
    "1 tsp fresh thyme (or ½ tsp dried)",
    "2 bay leaves",
    "1 lb Yukon Gold potatoes, cubed",
    "4 carrots, cut into 1\" pieces",
    "1 cup frozen peas",
    "Salt and pepper"
  ],
  "steps": [
    "Pat beef dry with paper towels. Season generously with salt and pepper, then toss with flour to coat lightly.",
    "Heat oil in a Dutch oven over medium-high heat. Brown beef in batches (don't crowd the pan). Remove to a plate. Takes about 10 minutes total.",
    "Add onion to pot. Cook until softened, 5 minutes. Add garlic and tomato paste, cook 1 minute until fragrant.",
    "Pour in wine, scraping up browned bits from bottom. Simmer 2 minutes.",
    "Return beef and any juices to pot. Add broth, balsamic, thyme, and bay leaves. Bring to boil, then reduce heat to low. Cover and simmer 1½ hours.",
    "Add potatoes and carrots. Cover and cook 45 more minutes until vegetables and beef are tender.",
    "Stir in peas, cook 5 minutes. Remove bay leaves. Taste and adjust seasoning."
  ],
  "notes": [
    "The key: Brown meat in batches. Crowding = steaming = no flavor.",
    "Chuck roast vs stew meat: Buy a chuck roast and cut it yourself. Pre-cut \"stew meat\" is often random scraps.",
    "Oven method: After step 5, cover and bake at 325°F for the remaining time.",
    "Storage: Even better the next day. Keeps 4 days refrigerated, 3 months frozen."
  ],
  "source": "Adapted from Once Upon a Chef",
  "sourceUrl": "https://www.onceuponachef.com/recipes/beef-stew-with-carrots-potatoes.html"
}
