{
  "id": "chocolate-chip-cookies",
  "title": "Chocolate Chip Cookies",
  "tagline": "Brown butter, toffee notes, crispy edges, chewy center.",
  "description": "Brown butter, chewy center, crispy edges, toffee notes. The ATK method. Makes 16.",
  "category": "Baking",
  "categorySlug": "baking-dessert",
  "prep": "20 min",
  "cook": "12 min",
  "makes": "16",
  "ingredients": [
    "1¾ cups all-purpose flour",
    "½ tsp baking soda",
    "14 tbsp butter (1¾ sticks)",
    "½ cup granulated sugar",
    "¾ cup dark brown sugar, packed",
    "1 tsp salt",
    "2 tsp vanilla extract",
    "1 whole egg + 1 egg yolk",
    "1¼ cups chocolate chips or chunks"
  ],
  "steps": [
    "Whisk flour and baking soda in bowl. Set aside.",
    "Brown the butter: Melt 10 tbsp butter in skillet over medium-high heat, swirling constantly. Cook until milk solids turn dark golden brown and smell nutty, about 3 minutes. Transfer to large bowl.",
    "Add remaining 4 tbsp butter to hot browned butter. Stir until melted.",
    "Add both sugars, salt, and vanilla. Whisk until combined.",
    "Add egg and yolk. Whisk vigorously for 30 seconds. Let rest 3 minutes. Whisk 30 seconds. Rest 3 minutes. Whisk 30 seconds. (This develops structure.)",
    "Fold in flour mixture until just combined. Fold in chocolate chips.",
    "Roll dough into 16 balls (about 3 tablespoons each). Place on parchment-lined baking sheets, 2 inches apart.",
    "Bake at 375°F for 10-14 minutes until golden brown on edges but still soft in center.",
    "Cool on pan 5 minutes, then transfer to rack."
  ],
  "notes": [
    "BROWN THE BUTTER: This is the secret. Creates toffee/nutty flavor that's unmistakable.",
    "Dark brown sugar: More molasses = chewier cookie. Don't substitute light.",
    "The whisking/resting: Sounds fussy but it dissolves sugar and creates a glossy, crackly top.",
    "1 egg + 1 yolk: Extra yolk = chewier texture. Whole eggs make cakier cookies.",
    "Underbake slightly: They firm up as they cool. Golden edges, soft center = perfect."
  ],
  "source": "Adapted from America's Test Kitchen",
  "sourceUrl": "https://www.americastestkitchen.com/recipes/4737-perfect-chocolate-chip-cookies"
}
